Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/pmc.h
/* -------- PMC_GCSR0 : (PMC Offset: 0x190) ( R/ 32) Generic Clock Status Register 0 -------- */
#define PMC_GCSR0_GPID0_Pos                   _U_(0)                                               /**< (PMC_GCSR0) Generic Clock 0 Status Position */
#define PMC_GCSR0_GPID0_Msk                   (_U_(0x1) << PMC_GCSR0_GPID0_Pos)                    /**< (PMC_GCSR0) Generic Clock 0 Status Mask */
#define PMC_GCSR0_GPID0(value)                (PMC_GCSR0_GPID0_Msk & ((value) << PMC_GCSR0_GPID0_Pos))
#define PMC_GCSR0_GPID1_Pos                   _U_(1)                                               /**< (PMC_GCSR0) Generic Clock 1 Status Position */
#define PMC_GCSR0_GPID1_Msk                   (_U_(0x1) << PMC_GCSR0_GPID1_Pos)                    /**< (PMC_GCSR0) Generic Clock 1 Status Mask */
#define PMC_GCSR0_GPID1(value)                (PMC_GCSR0_GPID1_Msk & ((value) << PMC_GCSR0_GPID1_Pos))
#define PMC_GCSR0_GPID2_Pos                   _U_(2)                                               /**< (PMC_GCSR0) Generic Clock 2 Status Position */
#define PMC_GCSR0_GPID2_Msk                   (_U_(0x1) << PMC_GCSR0_GPID2_Pos)                    /**< (PMC_GCSR0) Generic Clock 2 Status Mask */
#define PMC_GCSR0_GPID2(value)                (PMC_GCSR0_GPID2_Msk & ((value) << PMC_GCSR0_GPID2_Pos))
#define PMC_GCSR0_GPID3_Pos                   _U_(3)                                               /**< (PMC_GCSR0) Generic Clock 3 Status Position */
#define PMC_GCSR0_GPID3_Msk                   (_U_(0x1) << PMC_GCSR0_GPID3_Pos)                    /**< (PMC_GCSR0) Generic Clock 3 Status Mask */
#define PMC_GCSR0_GPID3(value)                (PMC_GCSR0_GPID3_Msk & ((value) << PMC_GCSR0_GPID3_Pos))
#define PMC_GCSR0_GPID4_Pos                   _U_(4)                                               /**< (PMC_GCSR0) Generic Clock 4 Status Position */
#define PMC_GCSR0_GPID4_Msk                   (_U_(0x1) << PMC_GCSR0_GPID4_Pos)                    /**< (PMC_GCSR0) Generic Clock 4 Status Mask */
#define PMC_GCSR0_GPID4(value)                (PMC_GCSR0_GPID4_Msk & ((value) << PMC_GCSR0_GPID4_Pos))
#define PMC_GCSR0_GPID5_Pos                   _U_(5)                                               /**< (PMC_GCSR0) Generic Clock 5 Status Position */
#define PMC_GCSR0_GPID5_Msk                   (_U_(0x1) << PMC_GCSR0_GPID5_Pos)                    /**< (PMC_GCSR0) Generic Clock 5 Status Mask */
#define PMC_GCSR0_GPID5(value)                (PMC_GCSR0_GPID5_Msk & ((value) << PMC_GCSR0_GPID5_Pos))
#define PMC_GCSR0_GPID6_Pos                   _U_(6)                                               /**< (PMC_GCSR0) Generic Clock 6 Status Position */
#define PMC_GCSR0_GPID6_Msk                   (_U_(0x1) << PMC_GCSR0_GPID6_Pos)                    /**< (PMC_GCSR0) Generic Clock 6 Status Mask */
#define PMC_GCSR0_GPID6(value)                (PMC_GCSR0_GPID6_Msk & ((value) << PMC_GCSR0_GPID6_Pos))
#define PMC_GCSR0_GPID7_Pos                   _U_(7)                                               /**< (PMC_GCSR0) Generic Clock 7 Status Position */
#define PMC_GCSR0_GPID7_Msk                   (_U_(0x1) << PMC_GCSR0_GPID7_Pos)                    /**< (PMC_GCSR0) Generic Clock 7 Status Mask */
#define PMC_GCSR0_GPID7(value)                (PMC_GCSR0_GPID7_Msk & ((value) << PMC_GCSR0_GPID7_Pos))
#define PMC_GCSR0_GPID8_Pos                   _U_(8)                                               /**< (PMC_GCSR0) Generic Clock 8 Status Position */
#define PMC_GCSR0_GPID8_Msk                   (_U_(0x1) << PMC_GCSR0_GPID8_Pos)                    /**< (PMC_GCSR0) Generic Clock 8 Status Mask */
#define PMC_GCSR0_GPID8(value)                (PMC_GCSR0_GPID8_Msk & ((value) << PMC_GCSR0_GPID8_Pos))
#define PMC_GCSR0_GPID9_Pos                   _U_(9)                                               /**< (PMC_GCSR0) Generic Clock 9 Status Position */
#define PMC_GCSR0_GPID9_Msk                   (_U_(0x1) << PMC_GCSR0_GPID9_Pos)                    /**< (PMC_GCSR0) Generic Clock 9 Status Mask */
#define PMC_GCSR0_GPID9(value)                (PMC_GCSR0_GPID9_Msk & ((value) << PMC_GCSR0_GPID9_Pos))
#define PMC_GCSR0_GPID10_Pos                  _U_(10)                                              /**< (PMC_GCSR0) Generic Clock 10 Status Position */
#define PMC_GCSR0_GPID10_Msk                  (_U_(0x1) << PMC_GCSR0_GPID10_Pos)                   /**< (PMC_GCSR0) Generic Clock 10 Status Mask */
#define PMC_GCSR0_GPID10(value)               (PMC_GCSR0_GPID10_Msk & ((value) << PMC_GCSR0_GPID10_Pos))
#define PMC_GCSR0_GPID11_Pos                  _U_(11)                                              /**< (PMC_GCSR0) Generic Clock 11 Status Position */
#define PMC_GCSR0_GPID11_Msk                  (_U_(0x1) << PMC_GCSR0_GPID11_Pos)                   /**< (PMC_GCSR0) Generic Clock 11 Status Mask */
#define PMC_GCSR0_GPID11(value)               (PMC_GCSR0_GPID11_Msk & ((value) << PMC_GCSR0_GPID11_Pos))
#define PMC_GCSR0_GPID12_Pos                  _U_(12)                                              /**< (PMC_GCSR0) Generic Clock 12 Status Position */
#define PMC_GCSR0_GPID12_Msk                  (_U_(0x1) << PMC_GCSR0_GPID12_Pos)                   /**< (PMC_GCSR0) Generic Clock 12 Status Mask */
#define PMC_GCSR0_GPID12(value)               (PMC_GCSR0_GPID12_Msk & ((value) << PMC_GCSR0_GPID12_Pos))
#define PMC_GCSR0_GPID13_Pos                  _U_(13)                                              /**< (PMC_GCSR0) Generic Clock 13 Status Position */
#define PMC_GCSR0_GPID13_Msk                  (_U_(0x1) << PMC_GCSR0_GPID13_Pos)                   /**< (PMC_GCSR0) Generic Clock 13 Status Mask */
#define PMC_GCSR0_GPID13(value)               (PMC_GCSR0_GPID13_Msk & ((value) << PMC_GCSR0_GPID13_Pos))
#define PMC_GCSR0_GPID14_Pos                  _U_(14)                                              /**< (PMC_GCSR0) Generic Clock 14 Status Position */
#define PMC_GCSR0_GPID14_Msk                  (_U_(0x1) << PMC_GCSR0_GPID14_Pos)                   /**< (PMC_GCSR0) Generic Clock 14 Status Mask */
#define PMC_GCSR0_GPID14(value)               (PMC_GCSR0_GPID14_Msk & ((value) << PMC_GCSR0_GPID14_Pos))
#define PMC_GCSR0_GPID15_Pos                  _U_(15)                                              /**< (PMC_GCSR0) Generic Clock 15 Status Position */
#define PMC_GCSR0_GPID15_Msk                  (_U_(0x1) << PMC_GCSR0_GPID15_Pos)                   /**< (PMC_GCSR0) Generic Clock 15 Status Mask */
#define PMC_GCSR0_GPID15(value)               (PMC_GCSR0_GPID15_Msk & ((value) << PMC_GCSR0_GPID15_Pos))
#define PMC_GCSR0_GPID16_Pos                  _U_(16)                                              /**< (PMC_GCSR0) Generic Clock 16 Status Position */
#define PMC_GCSR0_GPID16_Msk                  (_U_(0x1) << PMC_GCSR0_GPID16_Pos)                   /**< (PMC_GCSR0) Generic Clock 16 Status Mask */
#define PMC_GCSR0_GPID16(value)               (PMC_GCSR0_GPID16_Msk & ((value) << PMC_GCSR0_GPID16_Pos))
#define PMC_GCSR0_GPID17_Pos                  _U_(17)                                              /**< (PMC_GCSR0) Generic Clock 17 Status Position */
#define PMC_GCSR0_GPID17_Msk                  (_U_(0x1) << PMC_GCSR0_GPID17_Pos)                   /**< (PMC_GCSR0) Generic Clock 17 Status Mask */
#define PMC_GCSR0_GPID17(value)               (PMC_GCSR0_GPID17_Msk & ((value) << PMC_GCSR0_GPID17_Pos))
#define PMC_GCSR0_GPID18_Pos                  _U_(18)                                              /**< (PMC_GCSR0) Generic Clock 18 Status Position */
#define PMC_GCSR0_GPID18_Msk                  (_U_(0x1) << PMC_GCSR0_GPID18_Pos)                   /**< (PMC_GCSR0) Generic Clock 18 Status Mask */
#define PMC_GCSR0_GPID18(value)               (PMC_GCSR0_GPID18_Msk & ((value) << PMC_GCSR0_GPID18_Pos))
#define PMC_GCSR0_GPID19_Pos                  _U_(19)                                              /**< (PMC_GCSR0) Generic Clock 19 Status Position */
#define PMC_GCSR0_GPID19_Msk                  (_U_(0x1) << PMC_GCSR0_GPID19_Pos)                   /**< (PMC_GCSR0) Generic Clock 19 Status Mask */
#define PMC_GCSR0_GPID19(value)               (PMC_GCSR0_GPID19_Msk & ((value) << PMC_GCSR0_GPID19_Pos))
#define PMC_GCSR0_GPID20_Pos                  _U_(20)                                              /**< (PMC_GCSR0) Generic Clock 20 Status Position */
#define PMC_GCSR0_GPID20_Msk                  (_U_(0x1) << PMC_GCSR0_GPID20_Pos)                   /**< (PMC_GCSR0) Generic Clock 20 Status Mask */
#define PMC_GCSR0_GPID20(value)               (PMC_GCSR0_GPID20_Msk & ((value) << PMC_GCSR0_GPID20_Pos))
#define PMC_GCSR0_GPID21_Pos                  _U_(21)                                              /**< (PMC_GCSR0) Generic Clock 21 Status Position */
#define PMC_GCSR0_GPID21_Msk                  (_U_(0x1) << PMC_GCSR0_GPID21_Pos)                   /**< (PMC_GCSR0) Generic Clock 21 Status Mask */
#define PMC_GCSR0_GPID21(value)               (PMC_GCSR0_GPID21_Msk & ((value) << PMC_GCSR0_GPID21_Pos))
#define PMC_GCSR0_GPID22_Pos                  _U_(22)                                              /**< (PMC_GCSR0) Generic Clock 22 Status Position */
#define PMC_GCSR0_GPID22_Msk                  (_U_(0x1) << PMC_GCSR0_GPID22_Pos)                   /**< (PMC_GCSR0) Generic Clock 22 Status Mask */
#define PMC_GCSR0_GPID22(value)               (PMC_GCSR0_GPID22_Msk & ((value) << PMC_GCSR0_GPID22_Pos))
#define PMC_GCSR0_GPID23_Pos                  _U_(23)                                              /**< (PMC_GCSR0) Generic Clock 23 Status Position */
#define PMC_GCSR0_GPID23_Msk                  (_U_(0x1) << PMC_GCSR0_GPID23_Pos)                   /**< (PMC_GCSR0) Generic Clock 23 Status Mask */
#define PMC_GCSR0_GPID23(value)               (PMC_GCSR0_GPID23_Msk & ((value) << PMC_GCSR0_GPID23_Pos))
#define PMC_GCSR0_GPID24_Pos                  _U_(24)                                              /**< (PMC_GCSR0) Generic Clock 24 Status Position */
#define PMC_GCSR0_GPID24_Msk                  (_U_(0x1) << PMC_GCSR0_GPID24_Pos)                   /**< (PMC_GCSR0) Generic Clock 24 Status Mask */
#define PMC_GCSR0_GPID24(value)               (PMC_GCSR0_GPID24_Msk & ((value) << PMC_GCSR0_GPID24_Pos))
#define PMC_GCSR0_GPID25_Pos                  _U_(25)                                              /**< (PMC_GCSR0) Generic Clock 25 Status Position */
#define PMC_GCSR0_GPID25_Msk                  (_U_(0x1) << PMC_GCSR0_GPID25_Pos)                   /**< (PMC_GCSR0) Generic Clock 25 Status Mask */
#define PMC_GCSR0_GPID25(value)               (PMC_GCSR0_GPID25_Msk & ((value) << PMC_GCSR0_GPID25_Pos))
#define PMC_GCSR0_GPID26_Pos                  _U_(26)                                              /**< (PMC_GCSR0) Generic Clock 26 Status Position */
#define PMC_GCSR0_GPID26_Msk                  (_U_(0x1) << PMC_GCSR0_GPID26_Pos)                   /**< (PMC_GCSR0) Generic Clock 26 Status Mask */
#define PMC_GCSR0_GPID26(value)               (PMC_GCSR0_GPID26_Msk & ((value) << PMC_GCSR0_GPID26_Pos))
#define PMC_GCSR0_GPID27_Pos                  _U_(27)                                              /**< (PMC_GCSR0) Generic Clock 27 Status Position */
#define PMC_GCSR0_GPID27_Msk                  (_U_(0x1) << PMC_GCSR0_GPID27_Pos)                   /**< (PMC_GCSR0) Generic Clock 27 Status Mask */
#define PMC_GCSR0_GPID27(value)               (PMC_GCSR0_GPID27_Msk & ((value) << PMC_GCSR0_GPID27_Pos))
#define PMC_GCSR0_GPID28_Pos                  _U_(28)                                              /**< (PMC_GCSR0) Generic Clock 28 Status Position */
#define PMC_GCSR0_GPID28_Msk                  (_U_(0x1) << PMC_GCSR0_GPID28_Pos)                   /**< (PMC_GCSR0) Generic Clock 28 Status Mask */
#define PMC_GCSR0_GPID28(value)               (PMC_GCSR0_GPID28_Msk & ((value) << PMC_GCSR0_GPID28_Pos))
#define PMC_GCSR0_GPID29_Pos                  _U_(29)                                              /**< (PMC_GCSR0) Generic Clock 29 Status Position */
#define PMC_GCSR0_GPID29_Msk                  (_U_(0x1) << PMC_GCSR0_GPID29_Pos)                   /**< (PMC_GCSR0) Generic Clock 29 Status Mask */
#define PMC_GCSR0_GPID29(value)               (PMC_GCSR0_GPID29_Msk & ((value) << PMC_GCSR0_GPID29_Pos))
#define PMC_GCSR0_GPID30_Pos                  _U_(30)                                              /**< (PMC_GCSR0) Generic Clock 30 Status Position */
#define PMC_GCSR0_GPID30_Msk                  (_U_(0x1) << PMC_GCSR0_GPID30_Pos)                   /**< (PMC_GCSR0) Generic Clock 30 Status Mask */
#define PMC_GCSR0_GPID30(value)               (PMC_GCSR0_GPID30_Msk & ((value) << PMC_GCSR0_GPID30_Pos))
#define PMC_GCSR0_GPID31_Pos                  _U_(31)                                              /**< (PMC_GCSR0) Generic Clock 31 Status Position */
#define PMC_GCSR0_GPID31_Msk                  (_U_(0x1) << PMC_GCSR0_GPID31_Pos)                   /**< (PMC_GCSR0) Generic Clock 31 Status Mask */
#define PMC_GCSR0_GPID31(value)               (PMC_GCSR0_GPID31_Msk & ((value) << PMC_GCSR0_GPID31_Pos))
#define PMC_GCSR0_Msk                         _U_(0xFFFFFFFF)                                      /**< (PMC_GCSR0) Register Mask  */

#define PMC_GCSR0_GPID_Pos                    _U_(0)                                               /**< (PMC_GCSR0 Position) Generic Clock 3x Status */
#define PMC_GCSR0_GPID_Msk                    (_U_(0xFFFFFFFF) << PMC_GCSR0_GPID_Pos)              /**< (PMC_GCSR0 Mask) GPID */
#define PMC_GCSR0_GPID(value)                 (PMC_GCSR0_GPID_Msk & ((value) << PMC_GCSR0_GPID_Pos)) 

